# 다양한 선 그리기
# cv2.line(img, start, end, color, thickness, lineType)
import cv2

img = cv2.imread('../data/blank_500.jpg')

# 파랑+초록 10픽셀
cv2.line(img, (100, 100), (400, 100), (255, 255, 0), 10)
# 파랑+빨강 10픽셀
cv2.line(img, (100, 150), (400, 150), (255, 0, 255), 10)
# 빨강+초록 10픽셀
cv2.line(img, (100, 200), (400, 200), (0, 255, 255), 10)
# 회색(파랑+초록+빨강) 10픽셀
cv2.line(img, (100, 250), (400, 250), (200, 200, 200), 10)
# 검은색 10픽셀
cv2.line(img, (100, 300), (400, 300), (0, 0, 0), 10)

# lineType - 계단현상 최소화 알고리즘
# 4연결 선 (브레젠햄)
cv2.line(img, (100, 350), (400, 400), (0, 0, 255), 20, cv2.LINE_4)
# 8연결 선 (브레젠햄)
cv2.line(img, (100, 400), (400, 450), (0, 0, 255), 20, cv2.LINE_8)
# 안티에일리어성(가우시안 필터) - 계단현상 없는 선
cv2.line(img, (100, 450), (400, 500), (0, 0, 255), 20, cv2.LINE_AA)
# 이미지 전체에 대각선
cv2.line(img, (0, 0), (500, 500), (0, 0, 255))

cv2.imshow('lines', img)
cv2.waitKey(0)
cv2.destroyAllWindows()